# SpotSlopeReferencePointIsSingular Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..DimensionFailures..::..SpotSlopeReferencePointIsSingular Property
BuiltInFailures..::..DimensionFailures Class See Also
---
The highlighted Spot Slope references an element point that is singular.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId SpotSlopeReferencePointIsSingular { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SpotSlopeReferencePointIsSingular As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ SpotSlopeReferencePointIsSingular {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..DimensionFailures Class
Autodesk.Revit.DB Namespace